"""                                     Вступ

Привіт!

У цьому модулі ми продовжимо вивчати ООП у Python і познайомимось з новими конструкціями, 
характерними для нього.

Розглянемо такі теми:

 -Магічні методи класів, використання __str__ та __repr__ , _getitem__ та __setitem__
- Перевизначення математичних операторів + , - , / , // , % , *
- Перевизначення операторів порівняння <, <=, >, >=, ==, !=
- Управління атрибутами та методами в класах. Гетери та сетери
- Статичні та класові методи і їх використання всередині класів
- Функтори і магічний метод __**call__**
- Створення об'єкта ітератора та генератора
- Методи передачі значень у генератор
-Створення власних менеджерів контексту

В результаті проходження модуля, ти розшириш свій toolkit з обєктно-орієнтованого програмування у Python.

"""